--3区灯塔--
<area3|ZA - 3区灯塔|-1>
LStick@0,127:1->LStick@0,127|A:0.1->~

--长椅--
<bench|ZA - 长椅（定点）|-1>
{
    LStick@0,127|A:0.05->LStick@0,127:0.05->~
}*180

--20区长椅--
<bench-area20|ZA - 20区长椅（白天面向座椅开始）|-1>
{
    A:0.05->0.05->~
}*10*3
15
LStick@0,-127:0.1->LStick@0,-127|B:0.1->LStick@0,-127:1.9->~
LStick@0,127:2.5->A:0.1
{
    A:0.05->0.05->~
}*10*3
13
LStick@0,-127:0.1->LStick@0,-127|B:0.1->LStick@0,-127:1.9->~
LStick@0,127:2.5->A:0.1

--20区北侧长椅--
<bench-area20-north|ZA - 20区北侧长椅（白天面向座椅开始）|-1>
{
    A:0.05->0.05->~
}*10*3
15
LStick@127,0:0.5->LStick@-127,0:0.4->~
LStick@-127,127:0.1->A:0.1
{
    A:0.05->0.05->~
}*10*3
13
LStick@127,0:0.5->LStick@-127,0:0.4->~
LStick@-127,127:0.1->A:0.1

--20区长椅-2--
<bench-area20-2|ZA - 20区长椅-2（白天面向座椅开始）|-1>
{
    A:0.05->0.05->~
}*10*3
15
LStick@-90,-127:0.1->LStick@-90,-127|B:0.1->LStick@-90,-127:5->LStick@0,-127:2.5->~
LStick@0,127:3.5->LStick@90,127:4.5->A:0.1
{
    A:0.05->0.05->~
}*10*3
13
LStick@-90,-127:0.1->LStick@-90,-127|B:0.1->LStick@-90,-127:5->LStick@0,-127:2.5->~
LStick@0,127:3.5->LStick@90,127:4.8->A:0.1
